[{"title": "", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "That Reports IPSIM22-011, IPSPL22-004, IPSTR22-008, Report IPSPL22-005, IPSCOM22-003, Report IPSPL22-006, CSD22-006, CSAD22-003, CLSHR22-010, CSSS22-010, CSACH22-009, CSSS22-004, and recommendation for Potential Transit Service to Norwood, be approved on Consent.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report CSSS22-010, dated May 9, 2022 of the Commissioner of Community Services as follows: a) That the presentation from Cathy Berges (Patient, Family, Caregiver Representative, Peterborough Ontario Health Team), Mark Graham (CEO, Canadian Mental Health Association Haliburton, Kawartha Pineridge; Peterborough Ontario Health Team Steering Committee member), Dr. Jackie Vanek (Physician), and Dr. Vanita Lokanathan (Primary Care Physician, Co-Lead Greater Peterborough Family Health Organization), be received for information; and b) That a letter of support be provided by the City to the Peterborough Ontario Health Team in support of its application to the province for annual funding in the amount of $7.6 million for a Community Health Centre, that will serve both the City and County of Peterborough.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "e) That the city provide an additional capital grant, equivalent to the municipal fees for the project, up to an amount of $50,000, to be funded from the Capital Levy Reserve.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Clarke", "Councillor Pappas", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "against": ["Councillor Beamer", "Councillor Riel Absent (1): Councillor Parnell"], "carried": true}, {"title": "22-023 - Being a By-law to levy and collect taxes for municipal, education and business improvement area purposes for the year 2022, to impose a penalty charge for non-payment of 2022 taxes, to provide for interest to be added to tax arrears, to establish that the City of Peterborough has now exited the Capping program for the Commercial, Industrial and Multi- Residential classes 22-024 - Being a By-law to establish Tax Ratios for prescribed property classes for the 2022 taxation year 22-025 - Being a By-law to amend the Zoning By-law for the lands known as 1199 Chemong Road 22-026 - Being a By-law to amend By-law 10-125 being a By-law to designate 788 Aylmer Street in the City of Peterborough pursuant to the Ontario Heritage Act, R.S.O. 1990, c. O.18. 22-027 - Being a By-law to Designate Certain Properties in the City of Peterborough Under the Ontario Heritage Act, R.S.O. 1990, c. O.18 (214-220 Aberdeen Avenue)", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "In response to the severe wind storm on May 21, 2022, that Schedule A of the User Fee Bylaw (21-113) be temporarily amended to suspend charges for receiving green waste only (tree branches and limbs) resulting directly from storm damage from the May 21, 2022 storm at the Peterborough County/City Waste Management Facility at 1260 Bensfort Road, Peterborough, ON, until June 30, 2022.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "In response to the severe wind storm on May 21, 2022, that Schedule A of the User Fee Bylaw (21-113) be temporarily amended to suspend charges for receiving green waste only (tree branches and limbs) resulting directly from storm damage from the May 21, 2022 storm at the Peterborough County/City Waste Management Facility at 1260 Bensfort Road, Peterborough, ON, until June 30, 2022. a) Council directs Staff to allocate resources and equipment to manage and remove debris from private property that has been piled on residential boulevards as a result of the recent windstorm.  This work would commence once municipal resources have completed addressing the storm clean-up operations from City- owned trees in municipal rights-of-way, parks, open spaces and trails; and, b) That staff report back to Council on the costs incurred to date and on the delay of regular projects, in six weeks.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "In response to the severe wind storm on May 21, 2022, that Schedule A of the User Fee Bylaw (21-113) be temporarily amended to suspend charges for receiving green waste only (tree branches and limbs) resulting directly from storm damage from the May 21, 2022 storm at the Peterborough County/City Waste Management Facility at 1260 Bensfort Road, Peterborough, ON, until June 30, 2022. a) Council directs Staff to allocate resources and equipment to manage and remove debris from private property that has been piled on residential boulevards as a result of the recent windstorm.  This work would commence once municipal resources have completed addressing the storm clean-up operations from City- owned trees in municipal rights-of-way, parks, open spaces and trails; and, b) That staff report back to Council on the costs incurred to date and on the delay of regular projects, in six weeks. Whereas, when MP Singh visited Peterborough on May 10 th , he was subjected to behaviour that the vast majority of the community completely and unequivocally condemns, Whereas, regardless of political leanings, a cornerstone of a healthy, functioning democracy is to engage in civil discourse without personal attacks and without violent threats, Whereas, the Council for the City of Peterborough wishes all residents and visitors to our community to feel safe and welcomed, and to experience the generosity of spirit of the good people who live here, not the hateful actions of a few, Therefore, be it resolved that the Mayor’s Office, on behalf of City Council, send Mr. Singh a letter, inviting him to return to our community for a discussion and to demonstrate that the recent actions of a small group are not an accurate representation of the people of Peterborough.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "22-028 - Being a By-law to confirm the proceedings of the Council at its regular meeting held on May 24, 2022", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel Absent (1): Councillor Parnell"], "carried": true, "against": []}]