[{"title": "That Council approve the recommendation outlined in Report IPSRE22-001, dated January 17, 2022, of the Interim Commissioner of Infrastructure and Planning Services, as follows: That staff be authorized to proceed as outlined in Closed Session Report IPSRE22-001, dated January 17, 2022, of the Interim Commissioner of Infrastructure and Planning Services.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report COU22-001 dated January 17, 2022, as follows: That the following appointments of Members of Council to Committees, Portfolios and Boards be approved for a term ending November 15, 2022, with the appointments as follow: a) Standing committees Finance Committee (all Members of Council) Keith Riel, Chair Gary Baldwin, Vice-Chair b) Portfolios Kim Zippel, Chair of Fire Services Diane Therrien, Chair of Planning c) Corporations and Legislatively Mandated Committees / Boards / Authorities i) Planning Advisory Committee Diane Therrien", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Riel", "Mayor Therrien", "Councillor Wright", "Councillor Zippel"], "against": ["Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "That report CAO22-001 be deferred to allow staff to provide a proposal on employment lands within the City of Peterborough Official Plan.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Clarke", "Councillor Riel", "Mayor Therrien", "Councillor Wright", "Councillor Zippel 4"], "against": ["Councillor Beamer", "Councillor Pappas", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "That report CAO22-001 be deferred to allow staff to provide a proposal on employment lands within the City of Peterborough Official Plan. That Council approve the recommendations outlined in Report CLSFS22-002 dated January 17, 2022, of the Commissioner of Corporate and Legislative Services, as follows: a) That $4.0 million Canada Community Building Fund (CCBF) Reserve Fund funding for the Pavement Preservation Program (2022 Capital Project 5-10.01) be replaced with $4.0 million of Ontario Community Infrastructure Fund; and b) That $935,600 Canada Community Building Fund (CCBF) Reserve Fund funding for the Road Surface Pavement Program (2022 Capital Project 5-10.02) be replaced with $935,600 of Ontario Community Infrastructure Fund.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "c) That Stewart Hamilton be appointed to serve as a member of the Peterborough Architectural Conservation Advisory Committee with a term until December 2025. d) That Craig Mortlock, Clara Blakelock, Dylan Radcliff, and Naomi Stock be appointed to serve as members of the Peterborough Environmental Advisory Committee with terms until December 2023. e) That Connor Kemp, Patrick Walsh, Caileigh McKnight, Margaret Chapman, Greg Picken, Steven Riddell, Merilyn Twiss, James Outterson, and Luke Parsons be appointed to serve as members of the Community Investment Grant Advisory Committee with terms until December 2023.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report CSD22-001 dated January 17, 2022, of the Commissioner of Community Services, as follows: That the verbal update given by Sheldon Laidman, Commissioner of Community Services be received for information.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "a) That the DelaFosse Library branch be closed permanently in its location at 729 Park Street South; b) That the lands known municipally as 729 Park Street South be declared surplus to the needs of the municipality and be authorized for sale; c) That all proceeds post sale of the lands known municipally as 729 Park Street South be committed to the cost for a replacement library facility; d) That the replacement location for the library facility be designated within the new Arena and Aquatics Complex at Morrow Park and completed as part of Phase 1 of the project previously approved by Council; e) That an amount of $250,000 in the Library Board Invested Funds be approved for transfer to the replacement library facility capital project to be used toward the construction; f) That the $3,520,000 plus HST additional costs be funded as follows: i. Canada Community Building Fund (CCBF) Reserve Fund - $2,020,000 ii. Development charges - $250,000 iii. Proceeds from the sale of 729 Park Street South - $1,000,000 (estimated) iv. Library Board - $250,000; g) That the Library Board be requested to enter into a lease agreement to ensure their commitment to operate the branch within the Arena and Aquatics Complex; and h) That the Mayor and Clerk be authorized to execute agreements between the City and Library Board to give effect to the recommendations in Report CSACH22-003 on terms acceptable to the Commissioner of Community Services and in forms acceptable to the City Solicitor.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "a)That delegated authority be provided to the Commissioner of Community Services to reduce the Game Day Expense amount payable by the Peterborough Pete's Limited to an amount determined by the Commissioner of Community Services to be reflective of the operational requirements during restrictions imposed in response to the COVID-19 pandemic; and; b) That staff provide an update report in the first quarter of 2023.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "That the Mayor on behalf of Council write a letter to support Peterborough Public Health-Board of Health’s letter, dated January 14, 2022, which requested an update on the status of the application for provincial funding for a Consumption and Treatment Services site (CTS) in Peterborough and requested a meeting with the Minister of Health, the Honourable Christine Elliott, and, That, the Honourable Doug Ford, Premier of Ontario, Peterborough Public Health- Board of Health Chair Andy Mitchell, local MPP’s , MP Michele Ferreri, Local Municipal and First Nation Councils, Donna Rogers, Executive Director of Fourcast, Peterborough Drug Strategy, Dr. Kieran. Moore, Ontario Chief MOH, Megan McCarrell, Executive Director, 360 Nurse Practitioner-Led Clinic Peterborough Drug Strategy, be copied on the letter.", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Akapo", "Councillor Baldwin", "Councillor Beamer", "Councillor Clarke", "Councillor Pappas", "Councillor Parnell", "Councillor Riel", "Mayor Therrien", "Councillor Vassiliadis", "Councillor Wright", "Councillor Zippel"], "carried": true, "against": []}]