[{"title": "That Council approve the recommendation outlined in Report LSRS23-004, dated October 30, 2023, of the Commissioner, Legislative Services as follows: That, respecting the property known municipally as 1138 Water Street, Peterborough, staff be directed to proceed as outlined in Closed Session Report LSRS23-004 dated October 30, 2023, of the Commissioner, Legislative Services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report CSFS23-001 - Fire Dispatch Services for the City of Belleville, and Report CSSS23-022 - Increase of Contract Amount Awarded to Nimble Information Strategies Inc. For Ontario Works Client File Digitization, be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSCLK23-004, dated October 30, 2023, of the City Clerk as follows: That the presentation on Physician Recruitment be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "use of Cash-in-Lieu of Parking with intent to support the creation of new municipal parking and EV charging where feasible; and, iii. That Staff include a project in the 2025 Capital Budget to formalize a permit parking program, including a review of unmetered parking lots together with any necessary changes to the on-street parking By-Law, as recommended in the Residential Parking Standards Review. iv. The parking permit review should include consideration on how permit numbers be allocated such as on a per residential property basis predicated upon the zoning parking regulation applicable to that property. v. That three parking permit pilot projects be undertaken in 2024 in parking zones. vi. That outreach with the broader community be undertaken during the process.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Riel"], "carried": true}, {"title": "use of Cash-in-Lieu of Parking with intent to support the creation of new municipal parking and EV charging where feasible; and, iii. That Staff include a project in the 2025 Capital Budget to formalize a permit parking program, including a review of unmetered parking lots together with any necessary changes to the on-street parking By-Law, as recommended in the Residential Parking Standards Review. iv. The parking permit review should include consideration on how permit numbers be allocated such as on a per residential property basis predicated upon the zoning parking regulation applicable to that property. v. That three parking permit pilot projects be undertaken in 2024 in parking zones. vi. That outreach with the broader community be undertaken during the process. a) That the presentation of the Residential Parking Standards Review by Paradigm Transportation Solutions Limited, and Report IPGPL23-003 be received.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "use of Cash-in-Lieu of Parking with intent to support the creation of new municipal parking and EV charging where feasible; and, iii. That Staff include a project in the 2025 Capital Budget to formalize a permit parking program, including a review of unmetered parking lots together with any necessary changes to the on-street parking By-Law, as recommended in the Residential Parking Standards Review. iv. The parking permit review should include consideration on how permit numbers be allocated such as on a per residential property basis predicated upon the zoning parking regulation applicable to that property. v. That three parking permit pilot projects be undertaken in 2024 in parking zones. vi. That outreach with the broader community be undertaken during the process. a) That the presentation of the Residential Parking Standards Review by Paradigm Transportation Solutions Limited, and Report IPGPL23-003 be received. That Council approve the recommendations outlined in Report IPGPL23-008, dated October 30, 2023, of the Commissioner of Infrastructure, Planning and Growth Management (Acting) as follows: a) That the Municipal Housing Pledge attached to Report IPGPL23-008 as Appendix F be endorsed by Council and signed by the Mayor; b) That the City Clerk be directed to submit Council’s resolution, Report IPGPL23- 008 and corresponding materials to the Ministry of Municipal Affairs and Housing by the deadline of December 15, 2023; and,", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That the rules be suspended to permit the proponent to provide comment.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Parnell Conflict (2): Councillor Beamer", "Mayor Leal"], "carried": true}, {"title": "That the rules be suspended to permit the proponent to provide comment. WHEREAS: 1. The Proponent is proposing to construct and operate a Long-Term Reliability Project, as defined and with the characteristics outlined in the table below, under the Long-Term Request for Proposals (“LT1 RFP”) issued by the Independent Electricity System Operator (“IESO”). Unique Project ID of the Long-Term Reliability Project: LT1-007-5-1 Name of the Long-Term Reliability Project: North-End Peterborough Storage Legal Name of Proponent: Portlands Energy Center L.P. (doing business as Atura Power) or an Affiliate Technology of the Long-Term Reliability Project: Storage Maximum Contract Capacity of the Long-Term Reliability Project (in MW): 125 Property Identification Number (PIN): 28130-0112 (the Trent University owned Lands) 2. Pursuant to the LT1 RFP, Proposals that receive the formal support of the local jurisdictional authorities of all the project communities in which the Long-Term Reliability Project is located in the form of a support resolution will be awarded Rated Criteria points for the purpose of ranking the Proposal in relation to other Proposals for a contract under the LT1 RFP; and NOW THEREFORE BE IT RESOLVED THAT: 1.The council of the City of Peterborough supports the development, construction and operation of the Long-Term Reliability Project on the Trent University owned Lands located within the Municipal boundaries of the City of Peterborough. 2.This resolution's sole purpose is to enable the Proponent to receive Rated Criteria Points under LT1 RFP or to satisfy its obligations under any awarded LT1 Contract and may not be used for the purpose of any other form of approval in relation to the Proposal or Long-Term Reliability Project or for any other purpose. Rated Criteria points will be used to rank the Proponent’s Proposal in relation to other Proposals received by the IESO under the LT1 RFP.", "for": ["Councillor Baldwin", "Councillor Crowley", "Councillor Lachica", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Duguay", "Councillor Haacke", "Councillor Parnell Conflict (2): Councillor Beamer", "Mayor Leal"], "carried": true}, {"title": "That the rules be suspended to permit the proponent to provide comment. WHEREAS: 1. The Proponent is proposing to construct and operate a Long-Term Reliability Project, as defined and with the characteristics outlined in the table below, under the Long-Term Request for Proposals (“LT1 RFP”) issued by the Independent Electricity System Operator (“IESO”). Unique Project ID of the Long-Term Reliability Project: LT1-007-5-1 Name of the Long-Term Reliability Project: North-End Peterborough Storage Legal Name of Proponent: Portlands Energy Center L.P. (doing business as Atura Power) or an Affiliate Technology of the Long-Term Reliability Project: Storage Maximum Contract Capacity of the Long-Term Reliability Project (in MW): 125 Property Identification Number (PIN): 28130-0112 (the Trent University owned Lands) 2. Pursuant to the LT1 RFP, Proposals that receive the formal support of the local jurisdictional authorities of all the project communities in which the Long-Term Reliability Project is located in the form of a support resolution will be awarded Rated Criteria points for the purpose of ranking the Proposal in relation to other Proposals for a contract under the LT1 RFP; and NOW THEREFORE BE IT RESOLVED THAT: 1.The council of the City of Peterborough supports the development, construction and operation of the Long-Term Reliability Project on the Trent University owned Lands located within the Municipal boundaries of the City of Peterborough. 2.This resolution's sole purpose is to enable the Proponent to receive Rated Criteria Points under LT1 RFP or to satisfy its obligations under any awarded LT1 Contract and may not be used for the purpose of any other form of approval in relation to the Proposal or Long-Term Reliability Project or for any other purpose. Rated Criteria points will be used to rank the Proponent’s Proposal in relation to other Proposals received by the IESO under the LT1 RFP. That the rules of procedure be suspended to complete the agenda.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting adjourn at 10:05 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]