[{"title": "That the City Council meeting minutes of October 23 and November 6, 2023, be approved.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "That items Report CSFS23-001 - Fire Dispatch Services for the City of Belleville, Report CSSS23-022 - Increase of Contract Amount Awarded to Nimble Information Strategies Inc. For Ontario Works Client File Digitization, Report of Closed Session - Water Street, Report LSCLK23-004 - Physician Recruitment Update, Report IPGPL23-008 - 2031 Municipal Housing Pledge, Report FCSSFS23-013 - Presentation of the 2024 Draft Budget, Report CSD23-016 - Additional Resolution for Age-friendly Peterborough Community Action Plan, Report CSAC23-009 - Multi-Use Sport and Event Centre Update to Feasibility Study, Report IPGPL23- 005 - Community Planning Permit System Feasibility Study, and Report COU23- 008 - Responsibilities of the Chief Administrative Officer, be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report IPGPL23-003 dated October 30, 2023, as amended as follows: a) That the presentation of the Residential Parking Standards Review by Paradigm Transportation Solutions Limited, and Report IPGPL23-003 be received. b) That Staff be directed to implement the recommendations of the Residential Parking Standards Review (the study) as follows: i. That Staff initiate the process of amending the Zoning By-Law to implement new parking design standards and parking rates that largely reflect the recommendations of the study with a target approval timeframe of Q3, 2024; and ii. That Staff initiate the process of formalizing a procedure for the collection and use of Cash-in-Lieu of Parking with intent to support the creation of new municipal parking and EV charging where feasible; and, iii. That Staff include a project in the 2025 Capital Budget to formalize a permit parking program, including a review of unmetered parking lots together with any necessary changes to the on-street parking By-Law, as recommended in the Residential Parking Standards Review. iv. The parking permit review should include consideration on how permit numbers be allocated such as on a per residential property basis predicated upon the zoning parking regulation applicable to that property. v. That three parking permit pilot projects be undertaken in 2024 in parking zones. vi. That outreach with the broader community be undertaken during the process.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "Unique Project ID of the Long-Term Reliability Project: LT1-007-5-1 Name of the Long-Term Reliability Project: North-End Peterborough Storage Legal Name of Proponent: Portlands Energy Center L.P. (doing business as Atura Power) or an Affiliate Technology of the Long-Term Reliability Project: Storage Maximum Contract Capacity of the Long-Term Reliability Project (in MW): 125 Property Identification Number (PIN): 28130-0112 (the Trent University owned Lands) 2. Pursuant to the LT1 RFP, Proposals that receive the formal support of the local jurisdictional authorities of all the project communities in which the Long-Term Reliability Project is located in the form of a support resolution will be awarded Rated Criteria points for the purpose of ranking the Proposal in relation to other Proposals for a contract under the LT1 RFP; and NOW THEREFORE BE IT RESOLVED THAT: 1.The council of the City of Peterborough supports the development, construction and operation of the Long-Term Reliability Project on the Trent University owned Lands located within the Municipal boundaries of the City of Peterborough. 2.This resolution's sole purpose is to enable the Proponent to receive Rated Criteria Points under LT1 RFP or to satisfy its obligations under any awarded LT1 Contract and may not be used for the purpose of any other form of approval in relation to the Proposal or Long-Term Reliability Project or for any other purpose. Rated Criteria points will be used to rank the Proponent’s Proposal in relation to other Proposals received by the IESO under the LT1 RFP.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Mayor Leal"], "against": ["Councillor Duguay Absent (1): Councillor Beamer"], "carried": true}, {"title": "That Council pass an Inspection By-law in the form of by-law attached as Appendix A to Report LSMLES23-001.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true}, {"title": "epidemic and more are in the process; and Whereas the City of Peterborough has formally acknowledged housing and homelessness, mental health and addictions/substance misuse as key areas of priority in its Community Safety and Well-Being Plan; Therefore Be It Resolved That the City of Peterborough declare intimate partner violence an epidemic; and That the recommendations from the Renfrew County Coroner’s Inquest be referred to staff for consideration and, where appropriate, integrated within the City of Peterborough’s Community Safety and Well-Being Plan; and That a copy of this motion be sent to The Honourable Doug Ford, Premier of Ontario, The Honourable Sylvia Jones, M.P.P, Minister of Health and Dave Smith, MPP, Peterborough-Kawartha.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "That the following by-laws be approved: 23-112 - Being a by-law providing powers of entry for the purpose of inspection 23-113 - Being a by-law to establish the responsibilities of the Chief Administrative Officer for the City of Peterborough", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "23-114 - Being a By-law to confirm the proceedings of the Council at its meeting held on November 27, 2023.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}, {"title": "That the meeting be adjourned at 6:34 p.m.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Absent (1): Councillor Beamer"], "carried": true, "against": []}]