[{"title": "That the City Council meeting minutes of May 23, 2023 be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 2"], "carried": true, "against": []}, {"title": "Report IPSPL23-016, Pre-commitment of Funds and Award of ITT-19-23 Armour Road Reconstruction and Resurfacing, Report IPSENG23-010, Feasibility of New or Temporary Traffic Signals at the Intersection of Brealey Drive and Cherryhill Road, Report IPSENG23-013, Approval of a City-Wide Speed Limit Reduction in School Areas and the Implementation of Community Safety Zones, Report IPSENG23-014, Complimentary Transit for Youth 13-18, December 31, 2022 Financial Report (unaudited), Report CLSFS23-029, Report on emergency measures taken to remediate Jackson Creek and advise on funding, Report IPSES23-015, Community Sector Greenhouse Gas Emission Inventory and Update, Report IPSACP23-019, Community Safety - CCTV Project - Peterborough Police Services, Report CLSFS23-032,  Home Energy Efficiency Program Update and proposed Local Improvement Charges, Report IPSACP23-016, New Age- friendly Peterborough Community Action Plan 2023-2027, Report CSSS23-018, Graffiti Management Policy, 2024 Budget Guideline, Report CLSFS23-028, Report of Closed Session, Shelter Provision Update, March 31, 2023 Financial Update Report (Unaudited), Report CLSFS23-030, Charlotte Street (Aylmer Street to Park Street) Update, Report IPSACP23-018, Development Charge Reserve Funds 2022 Annual Report - City and Peterborough Utilities Commission, Report CLSFS23- 034, Housing Accelerator Fund, Report IPSPL23-02, and Request for Three Way Stop at Denure Drive and Kawartha Heights Boulevard be passed by Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report IPSPL23-017, dated June 5, 2023, of the Commissioner of Infrastructure and Planning Services as follows: a) That Schedule ‘A’ – Urban Structure to the Official Plan, as it relates to the property at 550 Braidwood Avenue, be amended to Neighbourhoods from Employment Districts in accordance with the draft amendment attached as Exhibit D to Report IPSPL23-017; b) That Schedule ‘B’ – Land Use Plan to the Official Plan, as it relates to the property at 550 Braidwood Avenue, be amended to Residential from General Employment in accordance with the draft amendment attached as Exhibit D to Report IPSPL23-017; c) That Section 3.9, Exceptions of Zoning By-law 1997-123 be amended to add Exception .358 and which identifies site-specific regulations to the portion of the property to change to a Residential zoning district in accordance with the draft amendment attached as Exhibit E to Report IPSPL23-017; d) That Section 3.9, Exceptions of Zoning By-law 1997-123 be amended to add Exception .359 and which identifies site-specific regulations to the portion of the property to remain in an Industrial zoning district in accordance with the draft amendment attached as Exhibit E to Report IPSPL23-017; and e) That the subject property be rezoned from M3.1 – Industrial District to R.5 – 358 – Residential District and M3.1 – 359 – Industrial District, in accordance with the draft amendment attached as Exhibit ‘E’ to Report IPSPL23-017.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "That section 3.9.311 of the Zoning By-law be modified in accordance with the draft amendment attached as Exhibit ‘C’ to Report IPSPL23-018.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Duguay"], "carried": true, "against": []}, {"title": "That section 3.9.311 of the Zoning By-law be modified in accordance with the draft amendment attached as Exhibit ‘C’ to Report IPSPL23-018. That Council approve the recommendations outlined in Report IPSPL23-019, dated June 5, 2023, of the Commissioner of Infrastructure and Planning Services as follows: a) That the subject property be rezoned from R.1, R.2, R.3 – Residential District to SP.241-H – Commercial District, in accordance with the draft amendment attached as Exhibit ‘C’ to Report IPSPL23-019. b) That the ‘H’ – Holding Symbol be removed at such time as an agreement is entered into for the provision of cash-in-lieu of parking and that the associated payment has been made to the City.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Duguay"], "carried": true, "against": []}, {"title": "That staff be authorized to proceed as outlined in Closed Session Report CLSFM23-022 dated June 12, 2023 of the Commissioner of Corporate and Legislative Services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Haacke"], "carried": true, "against": []}, {"title": "That staff be authorized to proceed as outlined in Closed Session Report CLSFM23-022 dated June 12, 2023 of the Commissioner of Corporate and Legislative Services. a) That Council endorse an integrated and centralized customer service approach for City Hall entitled Service Peterborough, minus the bathroom component and, b) That a capital project budget be established in the amount of $625,000 to implement the required changes, and that the amount be funded by a transfer from the Capital Levey Reserve.", "for": ["Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Baldwin", "Councillor Bierk", "Councillor Lachica", "Mayor Leal", "Councillor Riel"], "carried": true}, {"title": "longer able to occupy the building. This plan would also include steps for moving back into the new facility; g) That the City continue to maintain and undertake traditional repairs at the QACC to allow Activity Haven to deliver their programs until the building is redeveloped; and h) That any rejuvenation of Queen Alexandra Park be connected with the redevelopment of the QACC.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Lachica"], "carried": true}, {"title": "longer able to occupy the building. This plan would also include steps for moving back into the new facility; g) That the City continue to maintain and undertake traditional repairs at the QACC to allow Activity Haven to deliver their programs until the building is redeveloped; and h) That any rejuvenation of Queen Alexandra Park be connected with the redevelopment of the QACC. That staff coordinate and begin to implement by Spring and Summer 2023 a Pilot of a Peterborough Litter Action Plan in collaboration with engaged community organizations and businesses to protect our creeks, wetlands, greenspaces and public spaces from the harms of trash, litter and hazardous waste, which in turn will promote greater business and economic development; and, That staff create a dedicated public engagement portal on Connect Peterborough to support awareness and collect public input to inform the development of a completed Peterborough Litter Action Plan to be presented to Council in late 2023 or early 2024, to enable implementation by March 2024.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "e) That land assembly options be considered.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Riel"], "carried": true}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That the Notice of Motion be ruled out of Order.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Lachica", "Mayor Leal", "Councillor Riel"], "against": ["Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "23-066 Being a By-law to authorize the 2021 portion of the Roads Surface Pavement Program project at an estimated cost of $1,000,000 and the issuing of tax-supported debentures to a maximum of $1,000,000 to finance the work 23-067 Being a By-law to authorize the borrowing upon serial debentures in the aggregate principal amount of $14,722,700.00 towards the cost of certain capital works described in schedule “A” to this by-law 23-068 Being a By-law to authorize the borrowing upon serial debentures in the aggregate principal amount of $10,907,500.00 towards the cost of certain capital works described in schedule “A” to this by-law 23-069 Being a By-law to authorize the borrowing upon serial debentures in the principal amount of $3,100,000.00 towards the cost of a certain capital work described in schedule “A” to this by-law 23-070 Being a By-law to authorize the borrowing upon amortizing debentures in the principal amount of $6,500,000.00 towards the cost of certain capital works described in schedule “A” to this by-law 23-075 Being a By-law to Regulate Speed Limits on certain streets in the City of Peterborough 23-076 Being a By-law to Amend By-Law 13-098 being a By-Law to Designate a Part of a Highway in the City of Peterborough as a Community Safety Zone 23-077 Being a By-law to Amend By-Law 09-136 being a By-Law for the Regulation of Parking", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Parnell"], "carried": true, "against": []}, {"title": "That By-laws 23-073 and 23-074 be approved. 23-073 Being a By-law to amend the Zoning By-law for the lands known as 53 and 59 Leahy’s Lane 23-074 Being a By-law to amend the Zoning By-law for the lands known as 376 Rubidge Street", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Duguay"], "carried": true, "against": []}, {"title": "Fairgrave securing one or more rights of first refusal in relation to Airport lands adjacent to those currently leased by Flying Colours Corp.; Now therefore, be it resolved that the Mayor, Clerk, Chief Administrative Officer and Commissioner, Infrastructure and Planning Services, or any one or more of them, be authorized to execute such documents and to do such things that, in the opinion of the Chief Administrative Officer and the said Commissioner in consultation with the City Solicitor, are considered necessary or advisable in the City’s interests to facilitate the Acquisition on terms acceptable to the Chief Administrative Officer and said Commissioner and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "23-078 Being a By-law to confirm the proceedings of the Council at its meeting held on June 26, 2023", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel"], "against": ["Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "That this meeting adjourn at 9:15 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]