[{"title": "That Council approve the recommendation outlined in Report CLSFM23-022, dated June 12, 2023 of the Commissioner of Corporate and Legislative Services as follows: That staff be authorized to proceed as outlined in Closed Session Report CLSFM23-022 dated June 12, 2023 of the Commissioner of Corporate and Legislative Services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Haacke"], "carried": true, "against": []}, {"title": "That items December 31, 2022 Financial Report (unaudited), Report CLSFS23-029 and Report on emergency measures taken to remediate Jackson Creek and advise on funding, Report IPSES23-015 be approved as part of the Consent Agenda.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report IPSACP23-019, dated June 12, 2023 of the Commissioner of Infrastructure and Planning Services, as follows: a) That the report be received for information; and b) That the presentation from the Asset Management & Capital Planning Director and Climate Change Specialist be received.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 4"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report IPSACP23-019, dated June 12, 2023 of the Commissioner of Infrastructure and Planning Services, as follows: a) That the report be received for information; and b) That the presentation from the Asset Management & Capital Planning Director and Climate Change Specialist be received. That Council approve the recommendations outlined in Report CLSFS23-032, dated June 12, 2023 of the Commissioner of Corporate and Legislative Services as follows: a) That the information from the Peterborough Police Services Board for the Community Safety – CCTV project attached as Appendix A, be received for information; and b) That Council approve the installation of cameras on City infrastructure at various locations in the City’s downtown core as shown on the map attached in Appendix A to Report CLSFS23-032 subject to a favourable determination of the Privacy Impact Assessment referred to in Appendix A to Report CLSFS23-032 as determined by the Commissioner, Corporate and Legislative Services. c) That the Mayor and Clerk be authorized to execute documents to give effect to recommendation b) on terms acceptable to the Commissioner of Corporate and Legislative Services and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk"], "carried": true}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report IPSACP23-016, dated June 12, 2023 of the Commissioner of Infrastructure and Planning Services as follows: a) That the City give notice to the public of its intention to pass a by-law to authorize the undertaking of works as a local improvement pursuant to clause 36.6(2)(b) of O. Reg. 586/06 substantially in the form comprising Appendix A to Report IPSACP23-016; and b) That following the giving of notice to the public pursuant to recommendation a), the authorizing by-law substantially in the form comprising Appendix A to Report IPSACP23-016 be placed on a future Council meeting agenda for consideration of approval; and c) That Council receives for information, a draft By-Law to authorize the imposition of Special Charges attached as Appendix B to Report IPSACP23-016.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "(PACAC) provide input to Council on the heritage status of the QACC as part of the feasibility study; d) That the feasibility study includes other City approvals, such as site plan approvals, along with funding and finance options for the redevelopment; e) That staff undertake any additional studies and public consultation as part of the planning process; f) That staff work with Activity Haven to develop a transition plan to relocate their programs and services once redevelopment of the QACC starts or they are no longer able to occupy the building. This plan would also include steps for moving back into the new facility; g) That the City continue to maintain and undertake traditional repairs at the QACC to allow Activity Haven to deliver their programs until the building is redeveloped; and h) That any rejuvenation of Queen Alexandra Park be connected with the redevelopment of the QACC.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Lachica"], "carried": true}, {"title": "a) That the Age-friendly Peterborough Report Card 2017-2022 be received for information; b) That the Age-friendly Peterborough Community Action Plan 2023-2027 be approved; c) That the updated Age-friendly Peterborough Advisory Committee Terms of Reference be approved by repealing By-law 17-080 and By-law 18-072 and adopting the draft by-law attached as Appendix D in report CSSS23-018; and,", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "Whereas, occurrences of graffiti are on the rise in our City, which reflects poorly on the branding of our City. Furthermore, currently the City of Peterborough has no graffiti management policy in place to proactively manage graffiti-related issues. Be it resolved that staff be directed to do some extensive benchmarking and bring back a report to Council in the fall of 2023 about the development of a City- wide Graffiti Management Policy for effective and proactive management of graffiti-related issues.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting adjourn at 8:09 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]