[{"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report CLSFS23-030 - March 31, 2023 Financial Update and Report IPSACP23-018 - Charlotte Street Update be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That staff coordinate and begin to implement by Spring and Summer 2023 a Pilot of a Peterborough Litter Action Plan in collaboration with engaged community organizations and businesses to protect our creeks, wetlands, greenspaces and public spaces from the harms of trash, litter and hazardous waste, which in turn will promote greater business and economic development; and, That staff create a dedicated public engagement portal on Connect Peterborough to support awareness and collect public input to inform the development of a completed Peterborough Litter Action Plan to be presented to Council in late 2023 or early 2024, to enable implementation by March 2024.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Haacke", "Councillor Parnell"], "carried": true}, {"title": "as follows: a) That the Development Charge Reserve Funds – 2022 Annual Report for the City of Peterborough, as presented in Report CLSFS23-034, be received for information; and b) That the Peterborough Utilities Commission Report entitled Water Development Charges for the year ended December 31, 2022, appended to Report CLSFS23-034 as Appendix B, be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "as follows: a) That the Development Charge Reserve Funds – 2022 Annual Report for the City of Peterborough, as presented in Report CLSFS23-034, be received for information; and b) That the Peterborough Utilities Commission Report entitled Water Development Charges for the year ended December 31, 2022, appended to Report CLSFS23-034 as Appendix B, be received for information. That Council approve the recommendations outlined in Report IPSPL23-021, dated June 19, 2023 of the Acting Commissioner of Infrastructure and Planning Services as follows: a) That staff be directed to submit a Housing Accelerator Fund application to the Canada Mortgage and Housing Corporation; b) That Council approve the initiatives proposed to be included in the Housing Accelerator Fund Action Plan as outlined in Report IPSPL23-021 in principle; c) That the Chief Administrative Officer, in consultation with the Treasurer, be authorized to approve the Action Plan, including the refinement of the proposed initiatives, in support of the City’s application for the Housing Accelerator Fund prior to finalizing the application to the Canada Mortgage and Housing Corporation; d) That the Treasurer be authorized to sign the integrity declaration and attestation letter in support of the City’s submission to Housing Accelerator Fund; and e) That the Mayor and Clerk be authorized to execute all documents to effect a transfer to the City of the Housing Accelerator Fund on terms acceptable to the Commissioner of Corporate and Legislative Services and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 5"], "carried": true, "against": []}, {"title": "as follows: a) That the Development Charge Reserve Funds – 2022 Annual Report for the City of Peterborough, as presented in Report CLSFS23-034, be received for information; and b) That the Peterborough Utilities Commission Report entitled Water Development Charges for the year ended December 31, 2022, appended to Report CLSFS23-034 as Appendix B, be received for information. That Council approve the recommendations outlined in Report IPSPL23-021, dated June 19, 2023 of the Acting Commissioner of Infrastructure and Planning Services as follows: a) That staff be directed to submit a Housing Accelerator Fund application to the Canada Mortgage and Housing Corporation; b) That Council approve the initiatives proposed to be included in the Housing Accelerator Fund Action Plan as outlined in Report IPSPL23-021 in principle; c) That the Chief Administrative Officer, in consultation with the Treasurer, be authorized to approve the Action Plan, including the refinement of the proposed initiatives, in support of the City’s application for the Housing Accelerator Fund prior to finalizing the application to the Canada Mortgage and Housing Corporation; d) That the Treasurer be authorized to sign the integrity declaration and attestation letter in support of the City’s submission to Housing Accelerator Fund; and e) That the Mayor and Clerk be authorized to execute all documents to effect a transfer to the City of the Housing Accelerator Fund on terms acceptable to the Commissioner of Corporate and Legislative Services and in forms acceptable to the City Solicitor. That Council approve the recommendations outlined in Report CSACH23-002, dated June 19, 2023 of the Commissioner, Community Services as follows: a) That an update on the status of the Major Sport and Event Centre Study Project be received for information; b) That the preferred location of a Major Sport and Event Centre shall be in the Central Area in accordance with the \"Downtown First\" public investment strategy described in Section 4.3.1 x. of the Official Plan; c) That a reassessment of the original September 2018 Feasibility Study be undertaken to include: i. Updating capital works completed and providing new estimates of future capital needs that will be required at the Peterborough Memorial Centre; ii. A review of the changing landscape of competitive venues with a smaller project scope given a community ice pad is no longer necessary: iii. Review and revisions of financial operating projections; iv. An update to the economic impact model of operations and spending multipliers to the regional economy; v. Revisiting the scope of the project and updating the current cost analysis; d) That Council approve the award of a single source consulting assignment for the next phase of the Major Sport and Event Centre to Sierra Planning and Management, 206 Laird Avenue, Suite 200, Toronto, Ontario within the preapproved budget of $353,000.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Riel"], "carried": true}, {"title": "That staff provide a report on the feasibility to install a three way stop at the intersection of Denure Drive and Kawartha Heights Boulevard.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting adjourn at 8:22 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]