[{"title": "That the General Committee meeting minutes of October 23, October 30, November 6 and November 22, 2023 be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSRS23-002, dated December 4, 2023, of the Commissioner, Legislative Services as follows: That, respecting a property acquisition, staff be directed to proceed as outlined in Closed Session Report LSRS23-002 dated December 4, 2023, of the Commissioner, Legislative Services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Haacke"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report MOAIR23-002, dated December 4, 2023, of the Commissioner of Municipal Operations (Acting) as follows: That, respecting certain long-term leases at the Peterborough Municipal Airport, staff be authorized to proceed as outlined in Closed Session Report MOAIR23- 002, dated December 4, 2023, of the Commissioner of Municipal Operations.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That items Report LSCLK23-007 - Appointments to COPHI Board of Directors, Report CSSS23-023 - Additional Funding for the Incentive for Affordable Housing Capital Project, be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report CAOGR23-001 dated December 4, 2023, of the Chief Administrative Officer as follows: That the Government Relations Matters presentation be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Haacke"], "carried": true}, {"title": "b) That the start time for General Committee meetings remain at 6:00 p.m.", "for": ["Councillor Beamer", "Councillor Crowley", "Councillor Haacke", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Baldwin", "Councillor Bierk", "Councillor Duguay", "Councillor Lachica", "Councillor Riel"], "carried": true}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Parnell"], "carried": true}, {"title": "That Council approve the recommendations outlined in Report FCSSFS23-015, dated December 4, 2023 of the Commissioner of Finance and Corporate Support Services as follows: a) That the September 30, 2023 Quarterly Financial Update Report (Unaudited) attached as Appendix A to Report FCSSFS23-015, dated December 4, 2023, be received; b) That the 681 Monaghan Road project budget be increased by $18,931,121 from $2,621,540 to $21,552,661 to reflect the receipt of the National Housing Strategy, Rapid Housing Initiative grant; and c) That a By-law be passed authorizing the Mayor and Clerk to execute the Ontario Nuclear Emergency Management Program transfer payment agreement and any subsequent corresponding agreements or amendments, on terms acceptable to the Commissioner of Finance and Corporate Support Services, and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "b) That ITT-51-23, for the Abatement and Demolition of the House at 2151 Mervin Line be awarded to North American Demolition Inc., 43 Ivygreen Road, Keswick, Ontario, L4P 4B7, at a total cost $47,300 plus HST of $6,149 for a total cost of $53,449.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "b) That ITT-51-23, for the Abatement and Demolition of the House at 2151 Mervin Line be awarded to North American Demolition Inc., 43 Ivygreen Road, Keswick, Ontario, L4P 4B7, at a total cost $47,300 plus HST of $6,149 for a total cost of $53,449. That Council approve the recommendations outlined in Report IPGLPL23-007, dated December 4, 2023, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: a) That notice be given to rename as Deline Street the portion of those lands known as Hillside Street, from Cochrane Crescent to Simons Avenue, as shown in Appendix A to Report IPGPL23-007, in accordance with the City’s Notice to Public Policy. b) That the roads known as Hillside Street (from Cochrane Crescent to Simons Avenue) be established as a public highway upon approval of the by-law to rename a portion of Hillside Street to Deline Street. c) That the Commissioner of Infrastructure, Planning and Growth Management be delegated the authority to enact a by-law to give effect to the following action: i. Rename the portion of those lands known as Hillside Street (from Cochrane Crescent to Simons Avenue) to Deline Street. ii. Establish the road to be known as Deline Street as a public highway.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "b) That ITT-51-23, for the Abatement and Demolition of the House at 2151 Mervin Line be awarded to North American Demolition Inc., 43 Ivygreen Road, Keswick, Ontario, L4P 4B7, at a total cost $47,300 plus HST of $6,149 for a total cost of $53,449. That Council approve the recommendations outlined in Report IPGLPL23-007, dated December 4, 2023, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: a) That notice be given to rename as Deline Street the portion of those lands known as Hillside Street, from Cochrane Crescent to Simons Avenue, as shown in Appendix A to Report IPGPL23-007, in accordance with the City’s Notice to Public Policy. b) That the roads known as Hillside Street (from Cochrane Crescent to Simons Avenue) be established as a public highway upon approval of the by-law to rename a portion of Hillside Street to Deline Street. c) That the Commissioner of Infrastructure, Planning and Growth Management be delegated the authority to enact a by-law to give effect to the following action: i. Rename the portion of those lands known as Hillside Street (from Cochrane Crescent to Simons Avenue) to Deline Street. ii. Establish the road to be known as Deline Street as a public highway. That Council approve the recommendation outlined in Report IPGENG23-001, dated December 4, 2023, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: That an all-way stop not be implemented at the intersection of Kawartha Heights Boulevard and Denure Drive.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel"], "against": ["Councillor Crowley", "Councillor Haacke", "Councillor Vassiliadis"], "carried": true}, {"title": "b) That ITT-51-23, for the Abatement and Demolition of the House at 2151 Mervin Line be awarded to North American Demolition Inc., 43 Ivygreen Road, Keswick, Ontario, L4P 4B7, at a total cost $47,300 plus HST of $6,149 for a total cost of $53,449. That Council approve the recommendations outlined in Report IPGLPL23-007, dated December 4, 2023, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: a) That notice be given to rename as Deline Street the portion of those lands known as Hillside Street, from Cochrane Crescent to Simons Avenue, as shown in Appendix A to Report IPGPL23-007, in accordance with the City’s Notice to Public Policy. b) That the roads known as Hillside Street (from Cochrane Crescent to Simons Avenue) be established as a public highway upon approval of the by-law to rename a portion of Hillside Street to Deline Street. c) That the Commissioner of Infrastructure, Planning and Growth Management be delegated the authority to enact a by-law to give effect to the following action: i. Rename the portion of those lands known as Hillside Street (from Cochrane Crescent to Simons Avenue) to Deline Street. ii. Establish the road to be known as Deline Street as a public highway. That Council approve the recommendation outlined in Report IPGENG23-001, dated December 4, 2023, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: That an all-way stop not be implemented at the intersection of Kawartha Heights Boulevard and Denure Drive. That Council approve the recommendation outlined in Report MOPW23-005, dated December 4, 2023, of the Commissioner of Municipal Operations (Acting) as follows: That the contract for RFQQ-05-22 with Winslow Gerolamy Motors Limited, 1018 Lansdowne Street West, Peterborough, Ontario, K9J 1Z9 for the Supply and Delivery of One Wastewater Collection (WWC) Work-Body Truck, auxiliary charging infrastructure and staff training/capacity building be increased by $374,686.45 from $248,892.46 to $623,578.91, plus HST of $81,065.26, less an after-tax rebate of $100,000 for a total cost of $604,644.17.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Beamer", "Councillor Haacke"], "carried": true}, {"title": "approved; and, c) That Shareholder Report SH2023-003 – Appointment of Auditors attached as appendix C, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "approved; and, c) That Shareholder Report SH2023-003 – Appointment of Auditors attached as appendix C, be approved. That Council approve the recommendations outlined in Report CSSS23-025, dated December 4, 2023 of the Commissioner of Community Services as follows: a) That staff be authorized to negotiate an extension of existing operating agreements with St. John’s Retirement Homes Inc. (St John’s) and Ontario Aboriginal Housing Support Service Corporation (OAHSSC) to the end of December 2024, to allow for the planning for new Operating Agreements under the Housing Services Act, 2011; and b) That the Mayor and Clerk be authorized to execute an extension of operating agreements with St. John’s Retirement Homes Inc., and Ontario Aboriginal Housing Support Service Corporation once negotiated on terms satisfactory to the Commissioner of Community Services and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "disseminate information and routinely disclose public documents upon request outside of the MFIPPA process and; Whereas, government operations, public expectations, technologies, and legislation surrounding accountability and transparency have changed and; WHEREAS the creation, storage and utilization of records has changed significantly and; Whereas, Regulation 823 under MFIPPA continues to reference antiquated technology and does not adequately provide for cost recovery, and these financial shortfalls are borne by the municipal taxpayer and; Whereas, multiple requests from an individual, can be challenging for a municipality due to finite staff resources, the expense of producing a record due to its size, number or physical location and the operational impacts to respond to requests for records within the framework for extensions under the Act. Be It Resolved, the Province of Ontario be requested to undertake a review of the MFIPPA for the purpose of updating the Act to respond the to challenges currently faced by municipalities and that the City Clerk be directed to send correspondence on behalf of City Council to the Ontario. Ministry of Public and Business Service Delivery.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "disseminate information and routinely disclose public documents upon request outside of the MFIPPA process and; Whereas, government operations, public expectations, technologies, and legislation surrounding accountability and transparency have changed and; WHEREAS the creation, storage and utilization of records has changed significantly and; Whereas, Regulation 823 under MFIPPA continues to reference antiquated technology and does not adequately provide for cost recovery, and these financial shortfalls are borne by the municipal taxpayer and; Whereas, multiple requests from an individual, can be challenging for a municipality due to finite staff resources, the expense of producing a record due to its size, number or physical location and the operational impacts to respond to requests for records within the framework for extensions under the Act. Be It Resolved, the Province of Ontario be requested to undertake a review of the MFIPPA for the purpose of updating the Act to respond the to challenges currently faced by municipalities and that the City Clerk be directed to send correspondence on behalf of City Council to the Ontario. Ministry of Public and Business Service Delivery. That the hour be extended to complete the agenda.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Councillor Riel"], "against": ["Councillor Duguay", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "b) That staff report back to Council in the second quarter of 2024 upon further investigation regarding financial and non-financial benefits and a Change Management Plan, including public consultation, of the transfer of responsibility and authority for the water assets and service delivery;", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel"], "against": ["Councillor Duguay", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "b) That staff report back to Council in the second quarter of 2024 upon further investigation regarding financial and non-financial benefits and a Change Management Plan, including public consultation, of the transfer of responsibility and authority for the water assets and service delivery; c) That the Change Management Plan stipulates that no current International Brotherhood of Electrical Workers (IBEW) employees be displaced as a result of the transition in the transfer of water assets and service delivery to the City: and,", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "b) That staff report back to Council in the second quarter of 2024 upon further investigation regarding financial and non-financial benefits and a Change Management Plan, including public consultation, of the transfer of responsibility and authority for the water assets and service delivery; c) That the Change Management Plan stipulates that no current International Brotherhood of Electrical Workers (IBEW) employees be displaced as a result of the transition in the transfer of water assets and service delivery to the City: and, d) That a working group consisting of CAO Jasbir Raina, Michael Papadacos, Commissioner of Infrastructure, Planning and Growth Management (Acting), Patrick Devlin, Vice-President, Water Utility Services, John Stephenson President & CEO, Peterborough Utilities Group, Councillor Haacke, Richard Freymond, Commissioner, Finance and Corporate Support Services and Kyle Davis PUG to establish the common facts and parameters of the report and report back to Council with the common facts and parameters in subsequent updates.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting be adjourned at 10:15 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]