[{"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That items Report CAO24-004 - Peterborough Utilities Commission, Report MOENV24-023 - Negotiation Update, Report FCSCS24-001 - Commercial Lease Agreement, Report LSCLK24-008 - Civic Awards, Report FCSFS24-015 - 2024 Debenture Issue, Report FCSFS24-010 - Peterborough Utilities Commission, Development Charges Background Study Recommendations, Report IPGENG24- 019 - Spillsbury Drive Pedestrian Crossover, Report MOENV24-022 - Water- Wastewater Service Agreement for the Township of Cavan Monaghan - Early Termination, Report IPGACP24-012 - Community Building Retrofit Feasibility Study, Report CAOGR24-004 - Government Relations Matters - Update for June 17, 2024, Report LSCLK24-007 - Licencing of Driving Services, Report FCSFS24- 011 - December 31, 2023 Financial Report (Unaudited), and Report CSD24-003 - 2025 Community Service Agreements, be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Crowley"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report CAO24-003, dated June 17, 2024 of the Chief Administrative Officer as follows: a) That staff be authorized to immediately begin implementing a transition plan for the City to provide economic development and tourism related services effective January 1, 2025; b) That a budget in the amount of $341,000 be established for the remainder of 2024 to provide for immediate transitional costs including pivotal staff recruitments to prepare for delivery of those services on January 1, 2025 and funded as follows: i. $121,000 from the Municipal Accommodation Tax Reserve; and ii. $220,000 from the uncommitted funds in the Sports Tourism Sponsorship Capital project (#18-146); c) That in preparing the draft 2025 budget for economic development and tourism related services, staff be directed to ensure that the financial impact be no greater than the funding the City currently provides for third-party provision of these same services, including revenues from the Municipal Accommodation Tax; and d) That staff be directed to report back to Council in the August cycle respecting the appropriateness of creating of a Municipal Services Corporation for the purposes of serving as an eligible tourism entity.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Haacke", "Councillor Lachica"], "carried": true}, {"title": "That Council approve the recommendations outlined in Report CAO24-003, dated June 17, 2024 of the Chief Administrative Officer as follows: a) That staff be authorized to immediately begin implementing a transition plan for the City to provide economic development and tourism related services effective January 1, 2025; b) That a budget in the amount of $341,000 be established for the remainder of 2024 to provide for immediate transitional costs including pivotal staff recruitments to prepare for delivery of those services on January 1, 2025 and funded as follows: i. $121,000 from the Municipal Accommodation Tax Reserve; and ii. $220,000 from the uncommitted funds in the Sports Tourism Sponsorship Capital project (#18-146); c) That in preparing the draft 2025 budget for economic development and tourism related services, staff be directed to ensure that the financial impact be no greater than the funding the City currently provides for third-party provision of these same services, including revenues from the Municipal Accommodation Tax; and d) That staff be directed to report back to Council in the August cycle respecting the appropriateness of creating of a Municipal Services Corporation for the purposes of serving as an eligible tourism entity. a) That Advisory Committee Update, Report LSCLKS24-006, dated June 17, 2024, of the City Clerk be received for information; and b) That, if Council considers it appropriate to do so, Council direct as follows: i) That Report LSCLKS24-006 dated June 17 of the City Clerk be referred to the Mayor for consideration as to whether to recommend to Council any changes to the current complement of advisory committees and to the participation of members of Council on such advisory committees and on local boards, municipal corporations and third party organizations and corporations; ii) That the Mayor consult with each member of Council; iii) That City staff assist the Mayor as the Mayor may from time-to-time request; and iv) That the Mayor report back to Council with the Mayor’s recommendations, if any. c) That the Mayor consult with members of Council and staff regarding the governance model for COPHI.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That the City of Peterborough encourages both federal and provincial governments to increase support to college boards, by establishing metrics and direction around maintaining courses where cohorts offer a return on investment in the local economy, in small business and in filling jobs vital to a college’s immediate region. That this resolution be forwarded to the provincial ministry of colleges and universities, provincial ministry of economic development, job creation and trade, provincial ministry of labour, immigration, training and skills development, provincial ministry of the environment, conservation and parks, provincial ministry of natural resources and forestry, and provincial ministry of agriculture, food and rural affairs, the federal minister of immigration, MP Michelle Ferreri, and MPP Dave Smith.", "for": ["Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Baldwin", "Councillor Duguay", "Mayor Leal", "Councillor Parnell"], "carried": true}, {"title": "24-053 Being a By-law to approve the submission of an application to Ontario Infrastructure and Lands Corporation (“OILC”) for the long- term financing of certain capital work(s) of the Corporation of the City of Peterborough (the “Municipality”); and to authorize the entering into of a rate offer letter agreement pursuant to which the Municipality will issue debentures to OILC.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "24-054 Being a By-law to confirm the proceedings of the Council at its meeting held on June 24, 2024.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting be adjourned at 7:53 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]