[{"title": "That the General Committee minutes from April 22, 2024 be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report IPGACP24-011, dated May 13, 2024, of the Commissioner, Infrastructure, Planning and Growth Management (Acting) as follows: That respecting the Funding Agreements with First Nation Communities, staff be authorized to proceed as outlined in Closed Session Report IPGACP24-011, dated May 13, 2024, of the Commissioner of Infrastructure, Planning and Growth Management (Acting).", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report IPGENG24-012, dated May 13, 2024, of the Commissioner of Infrastructure, Planning and Growth Management (Acting) as follows: That the Calendar Parking restriction be removed on Humber Road, between the south side of Saugeen Crescent and 536 Humber Road.", "for": ["Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Baldwin"], "carried": true, "against": []}, {"title": "b) That the Canada Wide Early Learning and Child Care Growth Plan 2023-2026 be attached as Appendix D of the Peterborough Early Years and Child Care Service Plan 2019 – 2024 (linked as Appendix B to this report).", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Crowley"], "carried": true, "against": []}, {"title": "That Council approve the recommendations outlined in Report CSSS24-006, dated May 13, 2024 of the Commissioner of Community Services as follows: a) That the Housing Needs Assessment, included as Appendix A, the City of Peterborough Housing Review Final Report, included as Appendix B, and the presentation by Tim Welch, from Tim Welch Consulting Inc. (TWC Inc.) be received for information; b) That staff be directed to implement key strategic priorities and recommendations presented by TWC Inc. for the City of Peterborough as Service Manager in order to maximize funding and provide the most value in achieving legislated housing targets; c) That staff return to Council in fall 2024 to present the Community Housing Strategic Framework for the End of Mortgage (EOM) and End of Operating Agreements (EOA) and proposed funding formula; and d) That the Commissioner of Community Services be authorized and directed to enter service and exit agreements with housing providers for projects under Housing Services Act, S.O. 2011, c. 6, Sched. 1, that reach End of Operating Agreement or End of Mortgage in order to provide ongoing affordability for tenants and long-term sustainability for the project, in a form satisfactory to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "Whereas the Ontario Heritage Act amendments instituted by the provincial government in 2022 require municipalities to either designate properties listed under the Act or remove them from the heritage register by January 1, 2025; Whereas the City of Peterborough has 795 listed properties under this act, a volume that presents substantial logistical challenges to process within the prescribed timeframe, with the limited municipal resources available; Whereas municipalities across the province face similar challenges, casting doubt on the feasibility of the current deadline; Whereas the Architectural Conservancy Ontario (ACO) has urgently requested an extension of the deadline, emphasizing the near impossibility of municipalities meeting the current timeline without compromising the due process and integrity of heritage preservation; Therefore, be it resolved that the City of Peterborough formally requests the Province of Ontario to extend the deadline to process the listed properties under the Ontario Heritage Act from January 1, 2025, to January 1, 2030; Be it further resolved that this extension will allow the City of Peterborough, along with other municipalities, to more effectively engage with community stakeholders and property owners, ensuring that significant heritage properties are properly recognized and preserved; Be it finally resolved that a copy of this motion be sent to Premier Ford, the Minister of Citizenship and Multiculturalism, and relevant provincial officials to underscore the urgency and necessity of this request for the protection of Ontario’s heritage.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Haacke"], "carried": true}, {"title": "Whereas the Ontario Heritage Act amendments instituted by the provincial government in 2022 require municipalities to either designate properties listed under the Act or remove them from the heritage register by January 1, 2025; Whereas the City of Peterborough has 795 listed properties under this act, a volume that presents substantial logistical challenges to process within the prescribed timeframe, with the limited municipal resources available; Whereas municipalities across the province face similar challenges, casting doubt on the feasibility of the current deadline; Whereas the Architectural Conservancy Ontario (ACO) has urgently requested an extension of the deadline, emphasizing the near impossibility of municipalities meeting the current timeline without compromising the due process and integrity of heritage preservation; Therefore, be it resolved that the City of Peterborough formally requests the Province of Ontario to extend the deadline to process the listed properties under the Ontario Heritage Act from January 1, 2025, to January 1, 2030; Be it further resolved that this extension will allow the City of Peterborough, along with other municipalities, to more effectively engage with community stakeholders and property owners, ensuring that significant heritage properties are properly recognized and preserved; Be it finally resolved that a copy of this motion be sent to Premier Ford, the Minister of Citizenship and Multiculturalism, and relevant provincial officials to underscore the urgency and necessity of this request for the protection of Ontario’s heritage. That the Notice of Motion be ruled out of order.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Duguay", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis 8"], "against": ["Councillor Bierk", "Councillor Crowley", "Councillor Haacke", "Councillor Lachica", "Councillor Riel"], "carried": true}, {"title": "That the meeting be adjourned at 7:40 p.m..", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]