[{"title": "That the minutes of January 15, 2024, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 2"], "carried": true, "against": []}, {"title": "That the rules of procedure (section 10.2.1) be suspended to permit unregistered delegations from the DBIA to speak to Report FCSERM24-003, Downtown Patio Program Insurance.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report LSRS24-001 - Construction Project, Report LSOCS24-002 – Insurance Matters, Report FCSFS24-001 – Tax Adjustments and Appeals Under the Municipal Act, Report LSCLK24-001 – Citizen Appointments to Various Committees, Report CAOGR24-001 – Government Relations Matters (January 29, 2024), Report FCSFS24-002 – 2024 Borrowing By-law, and Sustainability of Municipal Finances be passed on consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "a) That Council proceed as outlined in Closed Session Report LSOCS24-004 dated January 29, 2024 of the City Solicitor respecting City of Peterborough Holdings Inc. and Peterborough Utilities Commission; and, b) That Council amend paragraph d) of its Council Directions to delete the words, “establish the common facts and parameters of the report and report back to Council with the common facts and parameters in subsequent updates” and to substitute the words, “to undertake due diligence investigations considered advisable by the City’s CAO in consultation with the working group and the City Solicitor including with the assistance of third party professionals reporting to the City considered advisable by the City’s CAO in consultation with the said Commissioners and the City Solicitor and that staff periodically report to Council”.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Parnell"], "carried": true}, {"title": "a) That Council proceed as outlined in Closed Session Report LSOCS24-004 dated January 29, 2024 of the City Solicitor respecting City of Peterborough Holdings Inc. and Peterborough Utilities Commission; and, b) That Council amend paragraph d) of its Council Directions to delete the words, “establish the common facts and parameters of the report and report back to Council with the common facts and parameters in subsequent updates” and to substitute the words, “to undertake due diligence investigations considered advisable by the City’s CAO in consultation with the working group and the City Solicitor including with the assistance of third party professionals reporting to the City considered advisable by the City’s CAO in consultation with the said Commissioners and the City Solicitor and that staff periodically report to Council”. d) That $2 million Commercial General Liability be the minimum accepted insurance limit for central area businesses seeking a patio extension licence, and that staff prepare a report on a tiered approach for the patio program for 2025;", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Lachica", "Mayor Leal", "Councillor Vassiliadis"], "against": ["Councillor Duguay", "Councillor Haacke", "Councillor Parnell", "Councillor Riel"], "carried": true}, {"title": "significant accomplishment of a person/group/team such as a provincial, national or international championship. b) That staff, in consultation with the CAO, be directed to deny an event application from an event organizer who has a demonstrated history of incomplete compliance with the City’s event rules, guidelines, or regulations or who has debt to the City, other than otherwise due and payable municipal taxes. c) That Council grant staff the authority to determine which events on City-owned land are high risk events and to impose as a condition of receiving a permit for a high-risk event that the City’s minimum insurance requirements be met at least 30-days before the permit’s issuance; d) That $2 million Commercial General Liability be the minimum accepted insurance limit for central area businesses seeking a patio extension licence, and that staff prepare a report on a tiered approach for the patio program for 2025; e) That a letter be sent to AMO and all member municipalities requesting an investigation into insurance matters and that AMO be encouraged to investigate the creation of an insurance company for municipal purposes; and, f) That staff report back by Q3, 2024, with a plan for the 2024/25 winter season and beyond on how the City will accommodate covering the liability insurance premiums for community volunteers as they relate to city activities.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "other housing forms – to provide greater flexibility in addressing the housing supply and affordability crisis; Therefore, be it resolved, that staff be directed to bring forward, with a sense of urgency, updates to appropriate regulatory mechanisms as required including the Official Plan and the Zoning By-law for Council’s approval to put an effective end to \"exclusionary zoning” in Peterborough, which could include expanding the City’s current Additional Residential Unit policies and regulations to permit up to four units per residential lot as of right.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "other housing forms – to provide greater flexibility in addressing the housing supply and affordability crisis; Therefore, be it resolved, that staff be directed to bring forward, with a sense of urgency, updates to appropriate regulatory mechanisms as required including the Official Plan and the Zoning By-law for Council’s approval to put an effective end to \"exclusionary zoning” in Peterborough, which could include expanding the City’s current Additional Residential Unit policies and regulations to permit up to four units per residential lot as of right. That Council approve the recommendations outlined in Report FCSERM24-003, dated February 5, 2024, of the Commissioner, Finance and Corporate Support Services as follows: a) That the supplemental information pertaining to insurance requirements for the Downtown Patio Licence Program, be received for information. b) That Council, at its meeting of February 5, 2024, consider staffs original recommendation d) as outlined in Report FCSERM24-003.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "and waste management systems (collectively, “municipal services”) pursuant to Section 2 of the Planning Act; Whereas the City of Peterborough has exhausted its supply of serviced employment land and has completed a Land Needs Assessment that identifies the need for more employment land; Whereas the City of Peterborough has available water and wastewater infrastructure capacity to accommodate new development and has plans in place to expand capacity to meet future growth needs, but has limited opportunity to develop new employment land by virtue of being land-locked; Whereas Section 6.1.7 of the Official Plan currently prohibits the extension of the City’s utility, sanitary sewer and water services beyond the existing City boundary except to serve City-owned facilities; Whereas historically the City of Peterborough has, in special circumstances, amended the Official Plan to support the extension of one or more municipal services beyond the City boundary to support development opportunities of mutual benefit to the City and certain neighbouring municipalities; And whereas the City of Peterborough will consider opportunities on a case-by- case basis to support mutually beneficial development with a neighbouring municipality to foster regional economic expansion and job growth which could include the extension of one or more municipal services beyond the City boundary; Therefore, be it resolved, that staff be directed to bring forward for Council’s consideration an update to the Official Plan to introduce greater flexibility for Council to consider the extension of municipal services beyond the existing City boundary in circumstances where doing so would mutually benefit the City and one or more neighbouring municipality.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Lachica"], "carried": true}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "recommendations and actively work with the Federal Government to ensure a fair and reasonable allocation of study permits that reflect the responsible approach Trent University has taken to recruiting and supporting international students and their importance to the region.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That by-law 24-008 Being a By-law to authorize the borrowing limit of $15,000,000 for 2024 current expenditures, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council reconsider a motion previously adopted by Council, regarding multi- residential waste collection.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "properties were Council to establish service level limits that would exceed the service limits as established by Waste Collection By-law 23-106; and, Whereas Council considers it appropriate to temporarily authorize service levels that exceed those established by the by-law pending consideration of the report. Now therefore be it resolved, That notwithstanding Waste Collection By-law 23-106, Council authorizes unseparated garbage and organics waste collection services to the multi- residential/condominium properties identified in a list provided by the Municipal Operations Department to the City Clerk until Council’s determination in response to the pending staff report; That staff be authorized to access up to $500,000 from the Waste Management Reserve to cover any expenses required; and, That the Commissioner, Municipal Operations be authorized to execute any documents and agreements to give effect to the forgoing, on terms acceptable to the said Commissioner in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis Conflict (1): Councillor Riel"], "carried": true, "against": []}, {"title": "That by-law 24-009, being a by-law to confirm the proceedings of the Council at its meeting of February 5, 2024, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]