[{"title": "", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That items Report LSRS24-006 - Consideration of a Property Matter - 625 Watts Avenue, Report LSRS24-007 - Consideration of a Property Matter - 280 Jameson Drive, Report LSRS24-010 - Consideration of a Property Matter - 195 Hunter Street East, Report IPGPL24-011 - Zoning By-law Amendment - Section 6.1 - Public Use Exemption, Report LSCLK24-008 - Fairhaven Presentation, Report FCSFPM24-010 - 2024 to 2028 Accessibility Plan, Report FCSFS24-008  - Notice of Public Meeting - Development Charges Background Study, Peterborough Utilities Commission, Report FCSFS24-009 - Development Charge Reserve Funds 2023 Annual Report - City and Peterborough Utilities Commission, Report FCSFS24-013 - Canadian Canoe Museum Funding Agreement and Designation as a Capital Facility, Report MOPW24-017 - Enrolment and Implementation of the Ministry of Transportation (MTO) Drive ON Program, Report FCSFPM24-017 - Budget Amendment and Award of ITT-43-24 for City Hall Service Peterborough Renovations, and Report IPGACP24-017 - 2024 Asset Management Plan.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSCLK24-009, dated June 3, 2024, of the City Clerk as follows: That the presentation by the Peterborough Community Health Centre be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis Conflict (1): Councillor Haacke"], "carried": true, "against": []}, {"title": "That the application be deferred, until further information is available for Council consideration.", "for": ["Councillor Bierk", "Councillor Lachica", "Councillor Riel"], "against": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis Conflict (2): Councillor Duguay", "Councillor Haacke"], "carried": false}, {"title": "And whereas By-law 1985-211 requires the granting of Site Plan Approval under Section 41 of the Planning Act prior to construction of the proposed residential building; And whereas on April 11, 2023, the Minister of Municipal Affairs and Housing approved a new Official Plan for the City of Peterborough that applies to all City decisions affecting planning matters, including Site Plan Approval, from that date forward; And whereas 2160288 Ontario Inc. has expressed their current intent to pursue Site Plan Approval and construction of the proposed 76-unit residential building consistent with the plan previously considered by staff and the Tribunal; And whereas Staff has determined that Section 4.4.3 of the City’s new Official Plan conflicts with the conceptual site plan that formed the basis of Staff’s previous recommendation and the Ontario Land Tribunal’s decision; And whereas Council has determined that it is desirable to support the proposed development, as shown on the conceptual site plan, which informed the land use changes supported by the Tribunal’s 2022 decision to facilitate the proposed residential building and to help achieve the City’s Housing Pledge to create 4700 new housing units by 2031; Now therefore be it resolved that staff be directed to initiate a site-specific Official Plan Amendment in accordance with Section 17 of the Planning Act to remedy any conflict between the current Official Plan and the conceptual site plan considered before the Ontario Land Tribunal as part of their 2022 decision to ensure that any application for Site Plan Approval on the lands is consistent with the conceptual site plan presented to the Ontario Land Tribunal; And further that due to its technical nature to implement a site-specific Ontario Land Tribunal decision, that the staff-initiated Official Plan Amendment be exempt from the review of the City’s Planning Advisory Committee as otherwise required by By-law 17-169.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Mayor Leal", "Councillor Parnell", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Lachica", "Councillor Riel Conflict (2): Councillor Duguay", "Councillor Haacke"], "carried": true}, {"title": "24-037 Being a By-law to Designate Certain Properties in the City of Peterborough Under the Ontario Heritage Act, R.S.O. 1990, c.O.18 (140 King Street) 24-038 Being a By-law Respecting the Appointment of a Deputy Clerk 24-039 Being a By-law to authorize an agreement with The Canadian Canoe Museum for the provision by it of a municipal capital facility, namely a canoe museum, and to exempt the lands owned by The Canadian Canoe Museum, located at 2077 Ashburnham Drive and part of 2011 Ashburnham Drive, in the City of Peterborough and designated as Parts 1, 2 and 3 on 45R-17193 from taxation for municipal and school purposes 24-040 Being a By-law to amend Section 6.1 of the Zoning By-law 24-041 Being a By-law to authorize the Mayor and Clerk to enter into a Franchise Agreement with Enbridge Gas Distribution Inc.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "WHEREAS the Association of Municipalities of Ontario (AMO) represents the interests of member municipalities on policy and program matters that fall within the jurisdiction of the provincial government; WHEREAS AMO’s Board of Directors is comprised of elected municipal officials from all regions and sizes of communities across Ontario to form a broad base of support and provide AMO with the united voice required to carry the municipal message to the provincial government; WHEREAS the election of AMO’s Board of Directors is held during AMO’s Annual Conference and Trade Show; BE IT RESOLVED that the Council for the City of Peterborough nominates Councillor Joy Lachica for a Director position on the Regional and Single Tier Caucus on the AMO Board of Directors for the 2024-2026 term; BE IT FURTHER RESOLVED that Council assumes all costs associated with Councillor Joy Lachica attending AMO Board of Directors meetings.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 9"], "carried": true, "against": []}, {"title": "That By-law 24-042 Being a By-law to confirm the proceedings of the Council at its meeting held on June 10, 2024, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting be adjourned.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]