[{"title": "That the minutes of January 8, 2024, be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "a) That Council proceed as outlined in Closed Session Report LSOCS24-004 dated January 29, 2024 of the City Solicitor respecting City of Peterborough Holdings Inc. and Peterborough Utilities Commission; and, b) That Council amend paragraph d) of its Council Directions to delete the words, “establish the common facts and parameters of the report and report back to Council with the common facts and parameters in subsequent updates” and to substitute the words, “to undertake due diligence investigations considered advisable by the City’s CAO in consultation with the working group and the City Solicitor including with the assistance of third party professionals reporting to the City considered advisable by the City’s CAO in consultation with the said Commissioners and the City Solicitor and that staff periodically report to Council”.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Parnell"], "carried": true}, {"title": "That Report LSOCS24-002 be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report LSOCS24-002 be received for information. That Council approve the recommendations outlined in Report LSRS24-001, dated January 29, 2024, of the Commissioner of Legislative Services as follows: a) That a $2,000,000 budget amount for the 2025 Capital budget for Lansdowne Street Rehabilitation – Park Street to Otonabee River be pre-committed; and b) That, respecting the Lansdowne Reconstruction Project, staff be authorized to proceed as outlined in Closed Session Report LSRS24-001 dated January 29,2024, of the Commissioner of Legislative Services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report FCSFS24-001 and LSCLK24-001 be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report CAOGR24-001 dated January 29, 2024, of the Chief Administrative Officer as follows: That the Government Relations Matters presentation be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That a by-law be enacted to establish a $15,000,000 borrowing limit for the 2024 year to finance current expenditures in the form attached as Appendix A.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That a by-law be enacted to establish a $15,000,000 borrowing limit for the 2024 year to finance current expenditures in the form attached as Appendix A. That Council approve the recommendations outlined in Report FCSERM24-001, dated January 29, 2024 of the Commissioner, Finance and Corporate Support Services as follows: a) That staff, in consultation with the CAO, be provided authority to deny event applications that include high-risk activities received with less than 30 days’ notice, with the exception of timely celebratory events intended to recognize the significant accomplishment of a person/group/team such as a provincial, national or international championship. b) That staff, in consultation with the CAO, be directed to deny an event application from an event organizer who has a demonstrated history of incomplete compliance with the City’s event rules, guidelines, or regulations or who has debt to the City, other than otherwise due and payable municipal taxes. c) That Council grant staff the authority to determine which events on City-owned land are high risk events and to impose as a condition of receiving a permit for a high-risk event that the City’s minimum insurance requirements be met at least 30- days before the permit’s issuance; and e) That a letter be sent to AMO and all member municipalities requesting an investigation into insurance matters and that AMO be encouraged to investigate the creation of an insurance company for municipal purposes.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That a by-law be enacted to establish a $15,000,000 borrowing limit for the 2024 year to finance current expenditures in the form attached as Appendix A. That Council approve the recommendations outlined in Report FCSERM24-001, dated January 29, 2024 of the Commissioner, Finance and Corporate Support Services as follows: a) That staff, in consultation with the CAO, be provided authority to deny event applications that include high-risk activities received with less than 30 days’ notice, with the exception of timely celebratory events intended to recognize the significant accomplishment of a person/group/team such as a provincial, national or international championship. b) That staff, in consultation with the CAO, be directed to deny an event application from an event organizer who has a demonstrated history of incomplete compliance with the City’s event rules, guidelines, or regulations or who has debt to the City, other than otherwise due and payable municipal taxes. c) That Council grant staff the authority to determine which events on City-owned land are high risk events and to impose as a condition of receiving a permit for a high-risk event that the City’s minimum insurance requirements be met at least 30- days before the permit’s issuance; and e) That a letter be sent to AMO and all member municipalities requesting an investigation into insurance matters and that AMO be encouraged to investigate the creation of an insurance company for municipal purposes. That item d) be deferred to receive additional information from staff.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "Whereas, the City of Peterborough has committed to the Provincial Housing Pledge of supporting the creation of 4,700 new units by 2031; Whereas, the City of Peterborough takes this responsibility seriously and has already implemented several initiatives to transform the planning and building ecosystem in our community and continues to move key initiatives forward; Whereas, the City of Peterborough has made application to the Canadian Mortgage and Housing Corporation's Housing Accelerator Fund to secure funding that is critical to facilitating this market transformation; Whereas the Minister of Housing, Infrastructure and Communities of Canada is publicly encouraging municipalities to end the practice of exclusionary zoning – zoning that only permits single or semi-detached dwellings to the exclusion of other housing forms – to provide greater flexibility in addressing the housing supply and affordability crisis; Therefore, be it resolved, that staff be directed to bring forward, with a sense of urgency, updates to appropriate regulatory mechanisms as required including the Official Plan and the Zoning By-law for Council’s approval to put an effective end to \"exclusionary zoning” in Peterborough, which could include expanding the City’s current Additional Residential Unit policies and regulations to permit up to four units per residential lot as of right.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "WHEREAS unprecedented population and housing growth will require significant investments in municipal infrastructure WHEREAS municipalities are being asked to take on complex health and social challenges – like homelessness, supporting asylum seekers and addressing the mental health and addictions crises WHEREAS inflation and rising interest rates are sharply constraining municipal fiscal capacity WHEREAS property taxpayers – including people on fixed incomes and small businesses – can’t afford to subsidize income re-distribution programs for those most in need WHEREAS the province can, and should, invest more in the prosperity of communities THEREFORE, BE IT RESOLVED THAT the Province of Ontario commit to undertaking with the Association of Municipalities of Ontario a comprehensive and collaborative social and economic prosperity review to promote the stability and sustainability of municipal finances across Ontario.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That this meeting be adjourned at 7:27 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}]