[{"title": "That the General Committee meeting minutes of October 28, November 4, November 12, November 18 and 19 and December 2, 2024 be approved.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSOCS25-002 dated January 6, 2025 of the City Solicitor as follows: That Council consider Closed Session Report LSOCS25-002 dated January 6, 2025 of the City Solicitor respecting Bill 242, Safer Municipalities Act, 2024.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council authorize staff to proceed as outlined in Closed Session Report FCSFS25-002 dated January 6, 2025, of the Commissioner, Finance and Corporate Support Services, respecting an agreement between the City of Peterborough and the County of Peterborough for consolidated municipal services.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council authorize staff to proceed as outlined in Closed Session Report FCSFS25-002 dated January 6, 2025, of the Commissioner, Finance and Corporate Support Services, respecting an agreement between the City of Peterborough and the County of Peterborough for consolidated municipal services. That the information provided by the Commissioner of Community Services and the City Solicitor respecting a proposed property acquisition be received.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Report FCSFS25-001 – Tax Adjustments under Section 356 and Tax Appeals under Sections 357, 358 and 359 of the Municipal Act, 2001 be approved on Consent.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSCLK25-001, dated January 6, 2025, of the City Clerk as follows: That the presentation by Nine Ships 1825, the Peter Robinson Irish Emigration 200 th Anniversary Commemoration Committee be received for information.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "That Council approve the recommendation outlined in Report LSCLK25-001, dated January 6, 2025, of the City Clerk as follows: That the presentation by Nine Ships 1825, the Peter Robinson Irish Emigration 200 th Anniversary Commemoration Committee be received for information. That Council approve the recommendation outlined in Report LSOCS25-001 dated January 6, 2025 of the Commissioner, Legislative Services as follows: That Council adopt the proposed business case study in the form comprising Appendix A to Report LSOCS25-001 respecting the establishment of a municipal services corporation as an eligible tourism entity.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "Support with Northminster Court under the name of Thrive Housing and Support; and b) That Council, acting as Service Manager, delegate to the Commissioner of Community Services authority to give consent for future amalgamations of community housing providers, under the Housing Services Act, 2011, and that the Commissioner of Community Services be delegated authority to execute such documents as are necessary to give effect to the foregoing terms and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "carried": true, "against": []}, {"title": "Support with Northminster Court under the name of Thrive Housing and Support; and b) That Council, acting as Service Manager, delegate to the Commissioner of Community Services authority to give consent for future amalgamations of community housing providers, under the Housing Services Act, 2011, and that the Commissioner of Community Services be delegated authority to execute such documents as are necessary to give effect to the foregoing terms and in forms acceptable to the City Solicitor. That Council approve the recommendations outlined in Report CSSS25-004, dated January 6, 2025 of the Commissioner of Community Services as follows: a) That Council approve the addition of up to 16 modular housing units at the Modular Bridge Housing Community on Wolfe Street, subject to the successful approval of the Encampment Response Initiative application and/or the Last Mile Funding. b) That subject to a successful funding application, staff be directed to proceed with the purchase and installation of the units as an exempt expenditure under authority of the Procurement Bylaw 24-077, Section 4.4-(g). c) That the Commissioner of Community Services be authorized to do such things and to execute such documents for the Modular Bridge Housing Community program for the duration of the program, on terms satisfactory to the said Commissioner and in forms acceptable to the City Solicitor.", "for": ["Councillor Baldwin", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Mayor Leal", "Councillor Riel"], "against": ["Councillor Beamer", "Councillor Haacke", "Councillor Lachica", "Councillor Parnell", "Councillor Vassiliadis"], "carried": true}, {"title": "1. That the provincial government be respectfully requested to amend Bill 242 to clearly define a workable standard for shelter space for the purposes of a municipality’s jurisdiction to enforce its standards regulating or prohibiting encampments in its parks and open spaces. 2. That, without limitation, Bill 242 provides that a municipality will have met the standard for shelter space for the purposes of the municipality’s jurisdiction to enforce its standards regulating or prohibiting encampments in its parks and open spaces: a) despite the establishment and enforcement of shelter rules including rules that prohibit drug use and other activities that could put shelter residents, workers and volunteers at risk; and b)  if an official designated by the municipality is satisfied that the number of available shelter spaces is at least equal to the aggregate of the number of individuals actually seeking shelter and the number of individuals against whom the municipality is planning to enforce its standards regulating or prohibiting encampments in its parks and open spaces. 3. That a copy of this resolution be sent to: a) Peterborough - Kawartha MPP Dave Smith; b) Honourable Doug Ford, Premier; c) Honourable Paul Calandra, Minister of Municipal Affairs and Housing; d) Honourable Doug Downey, Attorney General; e) Association of Municipalities of Ontario; and to f) Councils of each of Ontario’s municipalities.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis"], "against": ["Councillor Bierk", "Councillor Lachica"], "carried": true}, {"title": "That this meeting be adjourned at 8:14 p.m.", "for": ["Councillor Baldwin", "Councillor Beamer", "Councillor Bierk", "Councillor Crowley", "Councillor Duguay", "Councillor Haacke", "Councillor Lachica", "Mayor Leal", "Councillor Parnell", "Councillor Riel", "Councillor Vassiliadis 8"], "carried": true, "against": []}]